camerongillingham93/night-light/software/Microchip.ATtiny_DFP.3.2.268/edc/ATtiny3224.PIC
        <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="PITSTATUS" edc:nzwidth="0x8" edc:access="-------r" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x151">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
              <edc:SFRFieldDef edc:cname="CTRLBUSY" edc:nzwidth="0x1" edc:desc="CTRLA Synchronization Busy Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="PITINTCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x152">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
              <edc:SFRFieldDef edc:cname="PI" edc:nzwidth="0x1" edc:desc="Periodic Interrupt"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="PITINTFLAGS" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x153">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
              <edc:SFRFieldDef edc:cname="PI" edc:nzwidth="0x1" edc:desc="Periodic Interrupt"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x154"/>
        <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="PITDBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x155">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Run in debug"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2A" edc:_addr="0x156"/>
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="SWEVENTA" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x180">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="SWEVENTA" edc:nzwidth="0x8" edc:desc="Software event on channel">
                <edc:SFRFieldSemantic edc:cname="CH0" edc:desc="Software event on channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="CH1" edc:desc="Software event on channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CH2" edc:desc="Software event on channel 2" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="CH3" edc:desc="Software event on channel 3" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="CH4" edc:desc="Software event on channel 4" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CH5" edc:desc="Software event on channel 5" edc:when="(field &amp; 0xFF) == 0x20"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xF" edc:_addr="0x181"/>
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x190">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="CHANNEL0" edc:nzwidth="0x8" edc:desc="Channel 0 generator select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPDI" edc:desc="Unified Program and Debug Interface" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RTC_OVF" edc:desc="Real Time Counter overflow" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="RTC_CMP" edc:desc="Real Time Counter compare" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV8192" edc:desc="Periodic Interrupt Timer output 0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV4096" edc:desc="Periodic Interrupt Timer output 1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV2048" edc:desc="Periodic Interrupt Timer output 2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV1024" edc:desc="Periodic Interrupt Timer output 3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT0" edc:desc="Configurable Custom Logic LUT0" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT1" edc:desc="Configurable Custom Logic LUT1" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT2" edc:desc="Configurable Custom Logic LUT2" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT3" edc:desc="Configurable Custom Logic LUT3" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="AC0_OUT" edc:desc="Analog Comparator 0 out" edc:when="(field &amp; 0xFF) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_RES" edc:desc="ADC 0 Result ready event" edc:when="(field &amp; 0xFF) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_SAMP" edc:desc="ADC 0 Sample ready event" edc:when="(field &amp; 0xFF) == 0x25"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_WCMP" edc:desc="ADC 0 Window compare match event" edc:when="(field &amp; 0xFF) == 0x26"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN0" edc:desc="Port A Pin 0" edc:when="(field &amp; 0xFF) == 0x40"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN1" edc:desc="Port A Pin 1" edc:when="(field &amp; 0xFF) == 0x41"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN2" edc:desc="Port A Pin 2" edc:when="(field &amp; 0xFF) == 0x42"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN3" edc:desc="Port A Pin 3" edc:when="(field &amp; 0xFF) == 0x43"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN4" edc:desc="Port A Pin 4" edc:when="(field &amp; 0xFF) == 0x44"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN5" edc:desc="Port A Pin 5" edc:when="(field &amp; 0xFF) == 0x45"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN6" edc:desc="Port A Pin 6" edc:when="(field &amp; 0xFF) == 0x46"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN7" edc:desc="Port A Pin 7" edc:when="(field &amp; 0xFF) == 0x47"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN0" edc:desc="Port B Pin 0" edc:when="(field &amp; 0xFF) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN1" edc:desc="Port B Pin 1" edc:when="(field &amp; 0xFF) == 0x49"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN2" edc:desc="Port B Pin 2" edc:when="(field &amp; 0xFF) == 0x4A"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN3" edc:desc="Port B Pin 3" edc:when="(field &amp; 0xFF) == 0x4B"/>
                <edc:SFRFieldSemantic edc:cname="USART0_XCK" edc:desc="USART 0 XCK" edc:when="(field &amp; 0xFF) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="USART1_XCK" edc:desc="USART 1 XCK" edc:when="(field &amp; 0xFF) == 0x61"/>
                <edc:SFRFieldSemantic edc:cname="SPI0_SCK" edc:desc="SPI 0 Sclock" edc:when="(field &amp; 0xFF) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow / low byte underflow" edc:when="(field &amp; 0xFF) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 high byte underflow" edc:when="(field &amp; 0xFF) == 0x81"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0_LCMP0" edc:desc="Timer/Counter A0 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x84"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1_LCMP1" edc:desc="Timer/Counter A0 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x85"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2_LCMP2" edc:desc="Timer/Counter A0 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x86"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_CAPT" edc:desc="Timer/Counter B0 capture" edc:when="(field &amp; 0xFF) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_OVF" edc:desc="Timer/Counter B0 overflow" edc:when="(field &amp; 0xFF) == 0xA1"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_CAPT" edc:desc="Timer/Counter B1 capture" edc:when="(field &amp; 0xFF) == 0xA2"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_OVF" edc:desc="Timer/Counter B1 overflow" edc:when="(field &amp; 0xFF) == 0xA3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x191">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="CHANNEL1" edc:nzwidth="0x8" edc:desc="Channel 1 generator select">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="UPDI" edc:desc="Unified Program and Debug Interface" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RTC_OVF" edc:desc="Real Time Counter overflow" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="RTC_CMP" edc:desc="Real Time Counter compare" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV512" edc:desc="Periodic Interrupt Timer output 0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV256" edc:desc="Periodic Interrupt Timer output 1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV128" edc:desc="Periodic Interrupt Timer output 2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RTC_PIT_DIV64" edc:desc="Periodic Interrupt Timer output 3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT0" edc:desc="Configurable Custom Logic LUT0" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT1" edc:desc="Configurable Custom Logic LUT1" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT2" edc:desc="Configurable Custom Logic LUT2" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="CCL_LUT3" edc:desc="Configurable Custom Logic LUT3" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="AC0_OUT" edc:desc="Analog Comparator 0 out" edc:when="(field &amp; 0xFF) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_RES" edc:desc="ADC 0 Result ready event" edc:when="(field &amp; 0xFF) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_SAMP" edc:desc="ADC 0 Sample ready event" edc:when="(field &amp; 0xFF) == 0x25"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_WCMP" edc:desc="ADC 0 Window compare match event" edc:when="(field &amp; 0xFF) == 0x26"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN0" edc:desc="Port A Pin 0" edc:when="(field &amp; 0xFF) == 0x40"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN1" edc:desc="Port A Pin 1" edc:when="(field &amp; 0xFF) == 0x41"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN2" edc:desc="Port A Pin 2" edc:when="(field &amp; 0xFF) == 0x42"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN3" edc:desc="Port A Pin 3" edc:when="(field &amp; 0xFF) == 0x43"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN4" edc:desc="Port A Pin 4" edc:when="(field &amp; 0xFF) == 0x44"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN5" edc:desc="Port A Pin 5" edc:when="(field &amp; 0xFF) == 0x45"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN6" edc:desc="Port A Pin 6" edc:when="(field &amp; 0xFF) == 0x46"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN7" edc:desc="Port A Pin 7" edc:when="(field &amp; 0xFF) == 0x47"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN0" edc:desc="Port B Pin 0" edc:when="(field &amp; 0xFF) == 0x48"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN1" edc:desc="Port B Pin 1" edc:when="(field &amp; 0xFF) == 0x49"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN2" edc:desc="Port B Pin 2" edc:when="(field &amp; 0xFF) == 0x4A"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN3" edc:desc="Port B Pin 3" edc:when="(field &amp; 0xFF) == 0x4B"/>
                <edc:SFRFieldSemantic edc:cname="USART0_XCK" edc:desc="USART 0 XCK" edc:when="(field &amp; 0xFF) == 0x60"/>
                <edc:SFRFieldSemantic edc:cname="USART1_XCK" edc:desc="USART 1 XCK" edc:when="(field &amp; 0xFF) == 0x61"/>
                <edc:SFRFieldSemantic edc:cname="SPI0_SCK" edc:desc="SPI 0 Sclock" edc:when="(field &amp; 0xFF) == 0x68"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow / low byte underflow" edc:when="(field &amp; 0xFF) == 0x80"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 high byte underflow" edc:when="(field &amp; 0xFF) == 0x81"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0_LCMP0" edc:desc="Timer/Counter A0 compare 0 / low byte timer compare 0" edc:when="(field &amp; 0xFF) == 0x84"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1_LCMP1" edc:desc="Timer/Counter A0 compare 1 / low byte timer compare 1" edc:when="(field &amp; 0xFF) == 0x85"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2_LCMP2" edc:desc="Timer/Counter A0 compare 2 / low byte timer compare 2" edc:when="(field &amp; 0xFF) == 0x86"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_CAPT" edc:desc="Timer/Counter B0 capture" edc:when="(field &amp; 0xFF) == 0xA0"/>
                <edc:SFRFieldSemantic edc:cname="TCB0_OVF" edc:desc="Timer/Counter B0 overflow" edc:when="(field &amp; 0xFF) == 0xA1"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_CAPT" edc:desc="Timer/Counter B1 capture" edc:when="(field &amp; 0xFF) == 0xA2"/>
                <edc:SFRFieldSemantic edc:cname="TCB1_OVF" edc:desc="Timer/Counter B1 overflow" edc:when="(field &amp; 0xFF) == 0xA3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
